Tested with visibility set to "private" in us-east

```
2024-12-05T10:12:49.022-0500 [INFO]  provider.terraform-provider-ibm: 2024/12/05 10:12:49 [Debug] Sending HTTP request message...: timestamp=2024-12-05T10:12:49.022-0500
2024-12-05T10:12:49.022-0500 [INFO]  provider.terraform-provider-ibm: 2024/12/05 10:12:49 [DEBUG] GET https://tags.private.global-search-tagging.cloud.ibm.com/v3/tags?tag_type=access: timestamp=2024-12-05T10:12:49.022-0500
2024-12-05T10:12:49.810-0500 [INFO]  provider.terraform-provider-ibm: 2024/12/05 10:12:49 [Debug] Considering retry attempt; status_code=200, method=GET, url=https://tags.private.global-search-tagging.cloud.ibm.com/v3/tags?tag_type=access, error=nil: timestamp=2024-12-05T10:12:49.810-0500
2024-12-05T10:12:49.810-0500 [INFO]  provider.terraform-provider-ibm: 2024/12/05 10:12:49 [Debug] No retry for status code: 200: timestamp=2024-12-05T10:12:49.810-0500
2024-12-05T10:12:49.810-0500 [INFO]  provider.terraform-provider-ibm: 2024/12/05 10:12:49 [Debug] Received HTTP response message, status code 200: timestamp=2024-12-05T10:12:49.810-0500
2024-12-05T10:12:49.811-0500 [INFO]  provider.terraform-provider-ibm: 2024/12/05 10:12:49 [Debug] Response:
HTTP/2.0 200 OK

Terraform will perform the following actions:

  # ibm_is_security_group.example will be created
  + resource "ibm_is_security_group" "example" {
      + access_tags             = (known after apply)
      + crn                     = (known after apply)
      + id                      = (known after apply)
      + name                    = "example-security-group"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group          = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + rules                   = (known after apply)
      + tags                    = [
          + "sg",
          + "test",
        ]
      + vpc                     = "r014-b844255a-2c4e-4f12-817d-4b4f19eddda3"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```